In [1]:
import numpy as np
import pandas as pd

In [11]:
# csv
df = pd.read_csv('C:\\Users\\Alican\\03-Python Data Science Bootcamp\\example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [9]:
df.to_csv('saveexample.csv', index = False)

In [40]:
# html
url = 'https://en.wikipedia.org/wiki/World_population'

In [62]:
tables = pd.read_html(url, index_col = 0)

In [63]:
len(tables)

26

In [64]:
top10 = tables[1]

In [65]:
top10

World population (millions, UN estimates)[14]           World population (millions, UN estimates)[14]  \
#                                                                     Top ten most populous countries
1                                                                                            China[B]
2                                                                                               India
3                                                                                       United States
4                                                                                           Indonesia
5                                                                                            Pakistan
6                                                                                              Brazil
7                                                                                             Nigeria
8                                                                                          Bangladesh
9                                                                                              Russia
10                                                                                             Mexico
NaN                                                                                       World total
Notes: ^ 2030 = Medium variant. ^ China exclude...  Notes: ^ 2030 = Medium variant. ^ China exclud...

World population (millions, UN estimates)[14]                                                          \
#                                                                                                2000
1                                                                                                1270
2                                                                                                1053
3                                                                                                 283
4                                                                                                 212
5                                                                                                 136
6                                                                                                 176
7                                                                                                 123
8                                                                                                 131
9                                                                                                 146
10                                                                                                103
NaN                                                                                              6127
Notes: ^ 2030 = Medium variant. ^ China exclude...  Notes: ^ 2030 = Medium variant. ^ China exclud...

World population (millions, UN estimates)[14]                                                          \
#                                                                                                2015
1                                                                                                1376
2                                                                                                1311
3                                                                                                 322
4                                                                                                 258
5                                                                                                 208
6                                                                                                 206
7                                                                                                 182
8                                                                                                 161
9                                                                                                 146
10                                                                                                127
NaN                                                                                              7349
Notes: ^ 2030 = Medium variant. ^ China exclude...  Notes: ^ 2030 = Medium variant. ^ China exclud...

World population (millions, UN estimates)[14]
#                                                                                             2030[A]
1                                                                                                1416
2                                                                                                1528
3                                                                                                 356
4                                                                                                 295
5                                                                                                 245
6                                                                                                 228
7                                                                                                 263
8                                                                                                 186
9                                                                                                 149
10                                                                                                148
NaN                                                                                              8501
Notes: ^ 2030 = Medium variant. ^ China exclude...  Notes: ^ 2030 = Medium variant. ^ China exclud...

In [68]:
top10 = top10.drop('Notes: ^ 2030 = Medium variant. ^ China excludes Hong Kong and Macau.', axis = 0)

In [70]:
top10.columns = ['Country', '2000', '2015', '2030']

In [71]:
top10

           Country  2000  2015  2030
1         China[B]  1270  1376  1416
2            India  1053  1311  1528
3    United States   283   322   356
4        Indonesia   212   258   295
5         Pakistan   136   208   245
6           Brazil   176   206   228
7          Nigeria   123   182   263
8       Bangladesh   131   161   186
9           Russia   146   146   149
10          Mexico   103   127   148
NaN    World total  6127  7349  8501

In [72]:
top10.to_html('top10.html', index = False)

In [ ]:
# excel

In [75]:
exc = pd.read_excel('my_excel_file.xlsx', sheet_name = None)

In [76]:
exc

{'First_Sheet':     a   b   c   d
 0   0   1   2   3
 1   4   5   6   7
 2   8   9  10  11
 3  12  13  14  15}

In [79]:
exc.values()

dict_values([    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15])

In [81]:
from  sqlalchemy import create_engine

In [82]:
temp_db = create_engine('sqlite:///:memory:')

In [85]:
db = pd.DataFrame(data = np.random.randint(low = 0, high = 100, size = (4,4)), columns = ['a', 'b', 'c', 'd'])

In [86]:
db

    a   b   c   d
0  81   3  31  18
1  71  59  84  30
2  37  20  54  79
3  27  71  35  10

In [93]:
db.to_sql(name = 'new_table', con = temp_db, index = False)

In [94]:
df2 = pd.read_sql(sql = 'new_table', con = temp_db)

In [95]:
df2

    a   b   c   d
0  81   3  31  18
1  71  59  84  30
2  37  20  54  79
3  27  71  35  10

In [99]:
pd.read_sql_query(sql = 'SELECT a,c FROM new_Table WHERE a > 40 AND c < 40', con = temp_db)

    a   c
0  81  31